In [22]:
import pandas as pd
import numpy as np

In [61]:
india_weather=pd.DataFrame({
    'city':['mumbai','pune','banglore'],
    'temperature':[30,32,33],
    'humidity':[22,33,22],
    'rain':[40,80,90]
})

In [62]:
america_weather=pd.DataFrame({
    'city':['new york','san francisco','Boston'],
    'temperature':[34,56,44],
    'humidity':[12,55,66]
    
})

In [59]:
#---------------------the particular code is use for putting index in the conact date frame with a proper order----------#
#new_data=pd.concat([india_weather,america_weather],ignore_index=True)
#new_data.index=pd.RangeIndex(0,6)-> alternatr for ignore inex uppr paramter

In [60]:
new_data.replace(np.nan,'sunny')

            city  temperature  humidity   rain
0         mumbai           30        22     40
1           pune           32        33     80
2       banglore           33        22     90
3       new york           34        12  sunny
4  san francisco           56        55  sunny
5         Boston           44        66  sunny

In [111]:
#--------------------------making the keys for a subsets--------------------------------#
#reason-> To sort the values from a dataset example as for the indian cities and for US cities
new_data=pd.concat([india_weather,america_weather],keys=['indian_states','us_states'])

In [93]:
new_data.loc['indian_states']#-loc->loaction

       city  temperature  humidity  rain
0    mumbai           30        22  40.0
1      pune           32        33  80.0
2  banglore           33        22  90.0

In [613]:
temperature_data=pd.DataFrame({
    'city':['Mumbai','Pune','Banglore'],
    'temperature':[30,32,33],
    
},index=[0,1,2])
windspeed_data=pd.DataFrame({
    'city':['Mumbai','Pune','Banglore'],
    'windspeed':[20,22,31],
})

In [614]:
new_data_2=pd.concat([temperature_data,windspeed_data],ignore_index=True)#->the two data frames are getting concat in another dataframe

In [616]:
new_data_2

       city  temperature  windspeed
0    Mumbai         30.0        NaN
1      Pune         32.0        NaN
2  Banglore         33.0        NaN
3    Mumbai          NaN       20.0
4      Pune          NaN       22.0
5  Banglore          NaN       31.0

# THE PARTICULAT TASK IS HERE TO TO CUT THEB EXTRA "MUMABI" "PUNE "AND "BAGLORE "COLUMNS IN THE ROWS AND TO OUT ALL ONE OF THEM IN

In [617]:
# CREATING DATA FRAME WITH "WINDSPEED COLUMNS" FROM "CONACT DATAFRAME" BY "DROPING NA" VALUES IN IT 
data_3=new_data_2[['windspeed']].dropna()
data_3.reset_index(drop=True,inplace=True)
data_3

   windspeed
0       20.0
1       22.0
2       31.0

In [621]:
#GETTING THE "INDEX NUMBER" FROM THE MAIN "CONACT DATA FRAME" WHERE "WINDSPEED" HAS THE "NAN" VALUES GETTING THERI "INDEX"
a=new_data_2[new_data_2['windspeed'].isnull()==True].index#isnull()->the particlaur fucntion return true or false where it contains NAn values
a=list(a)

In [622]:
a

[0, 1, 2]

In [623]:
#COPING THE DATA FROM WHICH WE HAVE EXTRACTED AND PUTTING THEN IN TO ANOTHER DATA FRAME
for i in a:
    new_data_2['windspeed'][i]=data_3['windspeed'][i]

C:\Users\saket\anaconda3\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

In [624]:
new_data_2.dropna(axis=0,inplace=True)

In [625]:
new_data_2

       city  temperature  windspeed
0    Mumbai         30.0       20.0
1      Pune         32.0       22.0
2  Banglore         33.0       31.0

In [649]:
#ADDING THE SERIRES IN DATAFRAME
new_data_2['Events']=pd.Series(['Humid','Rain','windy'],name='Event')

In [651]:
new_data_2

       city  temperature  windspeed Events
0    Mumbai         30.0       20.0  Humid
1      Pune         32.0       22.0   Rain
2  Banglore         33.0       31.0  windy